# Label Utils Get Failure Severity Name Method

Source: https://www.revitapidocs.com/2026/4492bdf0-a671-14e2-5836-ec920cda69a5.htm

---

| Label Utils Get Failure Severity Name Method |
| --- |

Gets the user\-visible name for the Severity of a Warning
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetFailureSeverityName(
	FailureSeverity failureSeverity
)
```

```
Public Shared Function GetFailureSeverityName (
	failureSeverity As FailureSeverity
) As String
```

```
public:
static String^ GetFailureSeverityName(
	FailureSeverity failureSeverity
)
```

```
static member GetFailureSeverityName :
        failureSeverity : FailureSeverity -> string
```

#### Parameters

failureSeverity FailureSeverity
:   The Severity enum value

#### Return Value

String
Returns the user\-visible name for the Severity of a Warning. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Remarks The name is obtained in the current Revit language. See Also

#### Reference

LabelUtils Class Autodesk.Revit.DB Namespace